bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/edc/ATSAMC21N17A.PIC
      <edc:SFRDef edc:_addr="0x40000014" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="INTFLAGA" edc:impl="0x1FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSENS_" edc:desc="TSENS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000018" edc:access="--------------------------nnnnnn" edc:cname="INTFLAGB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTB_" edc:desc="MTB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000001C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INTFLAGC" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN0_" edc:desc="CAN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN1_" edc:desc="CAN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:desc="ADC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:desc="ADC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDADC_" edc:desc="SDADC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000020" edc:access="---------------------------nnnnn" edc:cname="INTFLAGD" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SERCOM6_" edc:desc="SERCOM6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM7_" edc:desc="SERCOM7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:desc="TC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:desc="TC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:desc="TC7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000024" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40000034" edc:access="-------------------rrrrrrrrrrrrr" edc:cname="STATUSA" edc:impl="0x1FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSENS_" edc:desc="TSENS APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000038" edc:access="--------------------------rrrrrr" edc:cname="STATUSB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTB_" edc:desc="MTB APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000003C" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="STATUSC" edc:impl="0xFFFFFF" edc:mclr="00000010000000000000000000000000" edc:nzwidth="0x20" edc:por="00000010000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN0_" edc:desc="CAN0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN1_" edc:desc="CAN1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:desc="ADC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:desc="ADC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDADC_" edc:desc="SDADC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
